tap "hashicorp/tap"
tap "homebrew/bundle"
tap "leoafarias/fvm"
brew "act"
brew "bat"
brew "broot"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "lefthook"
brew "mas"
brew "nkf"
brew "openjdk"
brew "pkgconf"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "starship"
brew "the_silver_searcher"
brew "volta"
brew "watch"
brew "yq"
brew "zplug"
brew "hashicorp/tap/terraform"
brew "leoafarias/fvm/fvm"
cask "appcleaner"
cask "applite"
cask "bitwarden"
cask "deepl"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "google-japanese-ime"
cask "imageoptim"
cask "ngrok"
cask "obsidian"
cask "raycast"
cask "slack"
cask "stoplight-studio"
cask "visual-studio-code"
cask "warp"

# AppStoreからインストール
if OS.mac?
  mas "Display Menu", id: 549083868
  mas "RunCat", id: 1429033973
  mas "Magnet", id: 441258766
end
