tap "coderabbitai/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "leoafarias/fvm"
brew "agent-browser"
brew "bat"
brew "broot"
brew "cloud-sql-proxy"
brew "cloudflared"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "genact"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "helm"
brew "hey"
brew "icu4c@76"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "lefthook"
brew "libmagic"
brew "libpq"
brew "mas"
brew "mise"
brew "neovim"
brew "nkf"
brew "openjdk@21"
brew "pkgconf"
brew "python@3.12"
brew "ruby-build"
brew "rbenv"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "uv"
brew "watch"
brew "yazi"
brew "yq"
brew "zplug"
brew "coderabbitai/tap/git-gtr"
brew "hashicorp/tap/terraform"
brew "leoafarias/fvm/fvm"
cask "appcleaner"
cask "bitwarden"
cask "copilot-cli"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "ghostty"
cask "google-japanese-ime"
cask "imageoptim"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"
