# GUI アプリ (cask) と VSCode 拡張機能は brew bundle で管理する。
# mise 2026.7.5 の [bootstrap.packages] は cask を brew に委譲せず自前実装で
# 再インストールしようとし、installer 型 cask (gcloud-cli) も非対応のため。
# formulae / tap は mise.toml の [bootstrap.*] 側で管理する。
cask "appcleaner"
cask "bitwarden"
cask "copilot-cli"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "gcloud-cli"
cask "ghostty"
cask "google-japanese-ime"
cask "imageoptim"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"

# VSCode 拡張機能 (エクスポート: code --list-extensions | sort -f)
# 宣言外の拡張は自動削除されない (prune は brew bundle cleanup --file=homebrew/Brewfile で手動確認)
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "antfu.iconify"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "corschenzi.mermaid-graphical-editor"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "figma.figma-vscode-extension"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "junstyle.php-cs-fixer"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "romanpeshkov.vscode-text-tables"
vscode "satokaz.vscode-bs-ctrlchar-remover"
vscode "shardulm94.trailing-spaces"
vscode "shopify.theme-check-vscode"
vscode "srmeyers.git-prefix"
vscode "tamasfe.even-better-toml"
vscode "typespec.typespec-vscode"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "xdebug.php-debug"
vscode "yzane.markdown-pdf"
